In [1]:
import pandas as pd

In [2]:
data1= [1,2,3,4,5,6]
series1 = pd.Series(data1)
print(series1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
# creating series from the dictionary
dis1 = {'a':1,'b':2,'c':3,"d":4,"e":5}
series2 = pd.Series(dis1)
print(series2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

# dataFrames

In [5]:
dis2 = {
    "Name":["SOurav","Subhan","Sumojot","Aftab"],
    "age":[21,24,21,25],
    "City":["Banglore","Hydrabad","Kolkata","Patna"]
}

df = pd.DataFrame(dis2)
print(df)

      Name  age      City
0   SOurav   21  Banglore
1   Subhan   24  Hydrabad
2  Sumojot   21   Kolkata
3    Aftab   25     Patna

In [6]:
# crearting data frame from the list of dictinary
list_data =[
    {"Name":"SOurav","age":21,"Profession":"data Engineer","Salary":2.5},
    {"Name":"Soumajit","age":20,"Profession":"Electric Engineer","Salary":1.0},
    {"Name":"Aniket","age":24,"Profession":"Mechanical Engineer","Salary":1.2},
    {"Name":"Harshbardhan","age":23,"Profession":"Civil Engineer","Salary":1.5},
]
df2 = pd.DataFrame(list_data)
print(df2)

           Name  age           Profession  Salary
0        SOurav   21        data Engineer     2.5
1      Soumajit   20    Electric Engineer     1.0
2        Aniket   24  Mechanical Engineer     1.2
3  Harshbardhan   23       Civil Engineer     1.5

In [7]:
print(df2.iloc[0][3])

2.5

C:\Users\hp\AppData\Local\Temp\ipykernel_3572\784117792.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df2.iloc[0][3])

In [10]:
print(df2.loc[0,"Name"])

SOurav

In [11]:
print(df2.at[2,"Name"])

Aniket

In [12]:
print(df2.iat[2,3])

1.2

In [13]:
df2["city"]=["Banglore","Patna","Mumbai","Noida"]
print(df2)

           Name  age           Profession  Salary      city
0        SOurav   21        data Engineer     2.5  Banglore
1      Soumajit   20    Electric Engineer     1.0     Patna
2        Aniket   24  Mechanical Engineer     1.2    Mumbai
3  Harshbardhan   23       Civil Engineer     1.5     Noida

In [14]:
#data manipulations 
df2.drop("Salary",axis=1,inplace=True)
#axis = 1, defines that we need to find "Salary" in column
# by default search is done in indexx row

In [15]:
print(df2)

           Name  age           Profession      city
0        SOurav   21        data Engineer  Banglore
1      Soumajit   20    Electric Engineer     Patna
2        Aniket   24  Mechanical Engineer    Mumbai
3  Harshbardhan   23       Civil Engineer     Noida

In [16]:
df2["age"]= df2["age"]+10
print(df2)

           Name  age           Profession      city
0        SOurav   31        data Engineer  Banglore
1      Soumajit   30    Electric Engineer     Patna
2        Aniket   34  Mechanical Engineer    Mumbai
3  Harshbardhan   33       Civil Engineer     Noida

In [17]:
# deleting a row
df2.drop(3,inplace=True)
print(df2)

       Name  age           Profession      city
0    SOurav   31        data Engineer  Banglore
1  Soumajit   30    Electric Engineer     Patna
2    Aniket   34  Mechanical Engineer    Mumbai

In [18]:
print(df2.describe())
# it gives details of integer data

             age
count   3.000000
mean   31.666667
std     2.081666
min    30.000000
25%    30.500000
50%    31.000000
75%    32.500000
max    34.000000